-- phpMyAdmin SQL Dump
-- version 4.5.4.1
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Апр 30 2016 г., 02:16
-- Версия сервера: 5.7.11
-- Версия PHP: 5.6.18

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL,
  `annot` varchar(500) NOT NULL,
  `bodytext` varchar(5000) NOT NULL,
  `category` varchar(200) NOT NULL,
  `date` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `annot`, `bodytext`, `category`, `date`) VALUES
(3, 'У машині студента УжНУ поліція знайшла зброю та наркотики ', 'Учора зранку наряд патрульної поліції зупинив на вул.Заньковецької в м.Ужгороді автомобіль «Хюндай» на іноземних номерах, водій якого порушив правила дорожнього руху.', 'За кермом іномарки перебував 22-річний студент УжНУ, житель Ужгорода. В салоні також перебував 26-річний пасажир. Поведінка обох видалася правоохоронцям підозрілою, тож вони вирішили оглянути салон. І недарма.\r\nВ барсетці пасажира поліцейські знайшли пістолет і ніж, а також нунчаки та біту. А під переднім пасажирським сидінням у пачці з-під сигарет виявили марихуану.\r\n\r\nУсе вилучене направлено на експертизу. Якщо вона підтвердить, що це справді зброя та наркотики, то на обох фігурантів справи очікує кримінальна відповідальність, пише Відділ комунікації ГУНП в Закарпатській області. \r\n', 'Ужгород', '21/04/2016'),
(4, 'Єврокомісія пропонує скасувати візи для України. Безвізовий режим можливий вже в липні', 'Про таке рішення йдеться в офіційному звіті Єврокомісії, що був оприлюднений вчора, 20 квітня.', 'Більше того, ЄК не згадує про жодні додаткові умови, які повинна виконати Україна для лібералізації безвізового режиму.\r\n" … Єврокомісія дійшла висновку, що Україна досягла необхідного прогресу і здійснила всі необхідні реформи, щоб забезпечити ефективне і стійке досягнення інших показників. На основі цієї оцінки та враховуючи результати постійного моніторингу, який здійснювався з моменту запуску діалогу щодо лібералізації візового режиму Україна-ЄС, Комісія підтвердила, що Україна виконала всі критерії для кожного з чотирьох блоків другої фази ПДВЛ, і що вона представить на початку 2016 року Законодавчу пропозицію внести зміни в регламент (EC) № 539/2001, вносячи Україну в список безвізових країн", - йдеться в документі, повідомляє Європейська Правда.\r\nВтім, після висновку Єврокомісії за процедурою має відбутись тривале узгодження у Європарламенті та між країнами-членами ЄС. В разі, якщо все піде за планом, безвізовий режим можливий вже в липні.\r\n', 'Політика', '20/04/2016'),
(5, 'Україна більше не імпортує газ з Угорщини\r\n', 'Імпорт природного газу з сусідньої країни призупинився 19 квітня, повідомляють у ПАТ "Укртрансгаз".\r\n', 'З 1 по 18 квітня з Угорщини було імпортовано 40, 7 млн куб. м газу. Щодоби до українських сховищ надходило від 1 до 4,1 млн куб. м. газу з боку Угорщини.\r\nЗ початку квітня з Європи було імпортовано 163,7 млн куб. м газу.\r\nДо прикладу, з Польщі - 69,4 млн куб. м., а зі Словаччини - 53,6 млн куб. м. Загалом у 2016-ому році Україна імпортувала 2,645 млрд куб. м газу, що більше, ніж в 2 рази менше, ніж за аналогічний період минулого року.', 'Економіка', '19/04/2016'),
(6, 'У Мукачеві обговорюють місця для встановлення велопарковок\r\n', 'За результатами робочої наради з активними представниками громадськості, які виступають за розвиток велоруху в Мукачеві попередньо погоджено і пропонується на обговорення варіант форми та три місця для облаштування велопарковок.\r\n', 'Враховуючи такі фактори як практичність, зручність, естетичність, безпека, ціна та простота виготовлення було обговорено і обрано варіант велопарковки дугоподіної форми з труби у вигляді літери "П". Така конструкція в плані безпеки, за словами ініціаторів, для велосипеда є найкращою і дає можливість причеплювати велосипеди різними варіантами. Крім того, простота виготовлення, монтажу та сучасний вигляд робить можливим встановлення її парках та зонах відпочинку.\r\nТа, на жаль, по стилю, не підходить для встановлення у центральній частині міста чи на замку Паланок. Для таких місць було запропоновано виготовити і встановити стилізовану "парковку-веломайстерню", де буде можливість для велосипедистів, при потребі скористатися основними велосипедними ключами різних видів чи підкачати колесо.\r\nЩодо місць встановлення, то для початку, запропоновано встановити першу велопарковку з 7 секцій для 14 велосипедів у парку Перемоги біля дитячого ігрового майданчику. Саме там є практична необхідність паркування велосипедів для батьків, які прийшли відпочивати в парк зі своїми дітками.\r\nДругим місцем обрано встановлення біля фонтану в мікрорайоні Росвигово вздовж доріжок, які не використовуються пішоходами.\r\nТретім місцем для встановлення саме велоаптечки запропоновано на площі Федорова, навпроти міського відділку міліції. Дане місце є найбільш захищеним в плані безпеки як для велосипедів так і самих ключів чи насоса самої велоаптечки Маємо надію, що встановлені в центральній частині міста камери відео нагляду та ріст громадської культури наших мешканців позитивно впливатимуть на довговічність велоаптечки.\r\nВ рамках проекту «ЄТМ-Карпатська мережа» заплановано встановлення 6 велопарковок по місту. Крім вищезгаданих місць, активістами було запропоновано ще декілька, а саме:\r\n1. на замку Паланок;\r\n2. в районі зеленого ринку;\r\n3. в районі міської поліклініки;\r\n4. в парковій зоні мікрорайону Підгоряни;\r\n5. поряд з міським центром зайнятості.\r\nПросимо всіх бажаючих долучитися до обговорення наступних кроків реалізації проекту в даному напрямку з аргументацією доцільності форми та місця встановлення, пише Мукачівська міськрада. ', 'Мукачево', '20/04/2016'),
(7, 'В Ужгороді стерилізують близько 200 безпритульних собак\r\n', 'Заходи розпочнуться обласному центрі вже наступного тижня.\r\n', 'Задля цього в Ужгород приїде команда фахівців - ветеринари, ловці тварин, адміністратор, доглядач.\r\nСтерилізація відбудеться за сприяння міжнародного благодійного фонду "Чотири лапи".\r\nПланується прооперувати понад дві сотні безпритульних собак, які гуртуються біля шкіл, лікарень, у промзонах, повідомляють в Ужгородській міській раді.', 'Ужгород', '12/04/2016'),
(8, 'Ощадбанк спокушає закарпатців -20% на Автоцивілку\r\n', 'У березні 2016 року Ощадбанк став лідером серед українських банків за обсягами реалізації полісів страхування обов\'язкової цивільної відповідальності.\r\n', 'А в квітні Ощадбанк запустив спеціальну пропозицію для усіх автовласників.\r\nЗавітайте вже зараз до найближчого відділення Ощадбанку та оформіть поліс страхування «Автоцивілка» зі знижкою 20%.\r\nУ банку зауважують, що ця пропозиція діє виключно до кінця квітня.', 'Економіка', '15/04/2016'),
(9, 'У Мукачеві вже повним ходом цвітуть каштани', 'У центральній частині Мукачева рясно зацвіли каштани .\r\n', 'Найчастіше каштани пишно розпускають свій біло-рожевий квіт навесні на початку травня, хоча бувають і аномальні цвітіння восени .\r\nЦього року вони зацвіли майже на два тижні раніше, ніж минулоріч, пише Мукачівська міськрада. ', 'Мукачево', '02/04/2016'),
(10, 'Угорщина відкрила у Львові візовий центр\r\n', 'Нещодавно Угорщина відкрила візовий центр аж у Харкові.\r\n', 'Як повідомив представник Львівської обласної держадміністрації повідомив "Українським новинам", візовий центр працює за адресою: вул. Під Дубом, 7а.\r\nВізовий центр відкрито у зв\'язку зі значним збільшенням кількості заявок на отримання угорської візи від громадян України за останні кілька років.\r\nВ офіційному відкритті взяли участь перший заступник голови Львівської обласної державної адміністрації Ростислав Замлинський і генеральний консул Угорщини в Ужгороді Йожев Бугайла.\r\n', 'Політика', '29/03/2016'),
(11, 'Вчора на Свалявщині затримали чергову партію "лівого" лісу ', 'Наразі, автомобіль із лісом поміщено на штрафмайданчик.\r\n', 'Вчора, близько обіду, інспектори  відділу з безпеки дорожнього руху Мукачівського відділу поліції, що обслуговують Свалявський район, зупинили для перевірки вантажівку з деревиною. Водій, 45-літній мешканець Воловецького району, перевозив більше 12 кубів породи «смерека». Даний вантаж водієві потрібно було доставити у с.Драчино Свалявського району. Під час перевірки супровідних документів з’ясувалося, що вантаж немає чіпів та товарної накладної. Сума завданого державі збитку складає більше 20 тисяч гривень.\r\n\r\nАвтомобіль з деревиною поміщено на штрафмайданчик Свалявського відділення поліції. За даним фактом триває перевірка.\r\n\r\nАвтомобілі, на яких перевозяться лісоматеріали, постійно перевіряються правоохоронцями. Поліцейські проводять огляд вантажу та документації, пише Відділ комунікації ГУНП в Закарпатській області. ', 'Правопорушення', '02/03/2016'),
(12, 'Гройсман обіцяє чергове підвищення тарифів на газ. Зобов\'язання перед МВФ?\r\n', 'Володимир Гройсман запевняє, що уряд України змушений піти на підвищення тарифів на газ.\r\n', '"Є зобов\'язання, які підписані українською стороною про те, що тарифи на газ будуть 100% відповідати вартості. Іншого шляху просто немає", - заявив прем\'єр-міністр Володимир Гройсман в ефірі "24 каналу". \r\n"Низькі або економічно необґрунтовані тарифи - це поле для жорсткої корупції", - каже прем\'єр.', 'Політика', '25/04/2016'),
(15, 'У Мукачеві черговий діалог між патрульними та активістами переріс у конфлікт', 'Активісти намагались перевірити патрульних поліцейських на знання правил дорожнього руху.\r\n', 'Активістів зупинили через порушення правил дорожнього руху і попросили пред\'явити документи. Водій пред\'явив, однак патрульні за виділений час не ознайомились і попросили знову їх пред\'явити.\r\nВодій відмовився показувати, через що і виник конфлікт.', 'Мукачево', '30/01/2016'),
(16, 'В Ужгороді 25 кращих писанкарів області готують великодню виставку\r\n', '22 квітня відбудеться відкриття виставки-конкурсу "Світ писанки", яку вже вдруге організовують обласний музей народної архітектури та побуту спільно з Закарпатським художнім інститутом.\r\n', 'Свої роботи представлять 25 писанкарів – як аматорів, котрі підтримують давні родинні звичаї, так і визнаних майстрів, які зуміли виробити власний почерк у цьому мистецтві. \r\nСеред учасників умільці з Ужгорода й околиць, Перечинщини, Мукачівщини, Тячівщини, а також з інших регіонів України – Київщини та Івано-Франківщини.\r\nЗагалом експонують понад 300 писанок, виконаних і традиційними, і сучасними техніками. Це, зокрема, мальованки, шкрябанки, яйця, декоровані вирізуванням, витравлюванням, випалюванням, воскові та дерев\'яні писанки, мотанки. \r\nВсе це розмаїття доповнять тематичні експонати з музейної збірки.\r\nВідкриття виставки розпочнеться о 15.00 із оголошення і нагородження переможців у трьох номінаціях конкурсу: "Традиційна писанка", "Авторська писанка", "Новаторське рішення", пише Управління культури Закарпатської ОДА. ', 'Ужгород', '14/03/2016'),
(17, 'Водій, який зносив усе на своєму шляху в центрі Ужгорода: "Я п\'яний такий як туча"', 'Перебуваючи за кермом старенького VW Passat водій спричинив спершу ДТП на вул.Капушанська, а тоді спробував втекти з місця пригоди.\r\n', 'Все сталося близько 18:00. За попередньою інформацією, разом з відверто п\'яним водієм у авто також перебувала жінка та маленька дитина. Водія затримала поліція.', 'Ужгород', '25/01/2016'),
(18, 'Поліція перевіряє закарпатський слід у справі "BlaBlaCar", де шукають зниклого львів’янина\r\n', 'Слідство по стрілянині в Мукачеві, учасників якої прив\'язують до зникнення львів’янина Тараса Познякова, проводить Генеральна прокуратура України.', 'Раніше в мережі з\'явилася інформація про причетність двох осіб на псевдо "Лука" та "Тоф" до зникнення Тараса Познякова з BlaBlaCar та начебто про їхню ж участь в подіях 11 липня в Мукачеві.\r\n\r\nУ поліції нагадують, що слідство по стрілянині в Мукачеві проводить Генеральна прокуратура України. Інформації щодо причетності даних осіб до мукачівських подій у нас немає.\r\n\r\nПриналежність "Луки" і "Тофа" до збройних формувань, зокрема і до обласного осередку "Правого сектору" та його спецпідрозділу "Сонечко" - перевіряється.\r\n\r\nА щодо причетності цих осіб до справи зникнення львів\'янина, то це компетенція органу, який проводить дане розслідування, пише Відділ комунікації ГУНП в Закарпатській області. \r\n', 'Правопорушення', '08/02/2016'),
(19, 'Мукачівців та гостей міста запрошують на майстер-клас із велоїзди\r\n', 'Велосипед – чудовий вид транспорту для міста, але поки що не всі вміють ним користуватися так, щоб не завдавати шкоди собі та оточуючим.\r\n', 'Активісти продовжують працювати над розвитком велоруху та підвищенням безпеки їзди на велосипеді.\r\nУ цю суботу (23 квітня) об 11.00 у парку Перемога, м. Мукачево пройдуть практичні зайняття з їзди на велосипеді. Навчання проведе майстер спорту міжнародного класу з велоспорту Артем Топчанюк.\r\nПід час майстер класу ти навчишся:\r\n-       круто володіти велосипедом\r\n-       правильно гальмувати і зупинятися\r\n-       правильно крутити педалі\r\n-       дізнаєшься деталі будови та обслуговування велосипеда\r\n-       навчишся впевнено їздити в групі\r\n-       правильно перемикати передачі на підйомах\r\n-       впевнено проходити спуски, повороти і віражі\r\n-       дізнаєшся як безпечно їздити по дорогах загального користування\r\nЗбір біля входу у парк, зі сторони мосту.', 'Мукачево', '16/03/2016'),
(20, 'Мукачівська школярка стала переможницею Міжнародного інструментального конкурсу у Києві', 'З 11 по 18 квітня цього року у Києві проходив IV Міжнародний інструментальний конкурс Євгена Станковича, нашого земляка, всесвітньо відомого українського композитора і музичного діяча.\r\n', 'Щороку цей конкурс охоплює найталановитіших дітей не тільки України, а й зарубіжжя: Канади, Білорусії, Австрії, Німеччини, Китаю та ін.\r\nНадзвичайно приємна звістка і для мукачівців - місто представляла юна вихованка Мукачівської дитячої школи мистецтв № 2 Олександра Макарова.\r\nУ нелегкому творчому змаганні вона здобула Диплом І премії (духові та ударні інструменти - ксилофон, клас викладача Олени Перести) та Диплом ІІ премії (фортепіано, клас викладача Магдалини Козуб), інформує Мукачівська міськрада. ', 'Мукачево', '06/02/2016'),
(21, 'Земельні ділянки на Берегівщині, які були привласнені шляхом підробки документів, повернуті державі\r\n', 'Мова йде, ймовірно, про прикордонні земельні ділянки.\r\n', 'Апеляційним судом Закарпатської області залишено в силі рішення Берегівського районного суду, яким задоволено позов Берегівської міжрайонної прокуратури про визнання недійсним Державних актів на право приватної власності на земельні ділянки загальною площею 0,3 га.\r\nЦим же рішенням вказані земельні ділянки витребувано від набувача.\r\nПідставою звернення прокуратури до суду слугувало те, що трьом громадянам ще у 2007 році були передані земельні ділянки в порушення закону - без відповідного рішення Берегівської міської ради, а шляхом підроблення Державних актів на право власності на земельні ділянки, пише Прес-служба прокуратури Закарпатської області. ', 'Правопорушення', '01/05/2016'),
(22, 'У центрі Мукачева продовжують висаджувати квіти', 'Роботи з благоустрою тривають на площі Кирила і Мефодія.\r\n', 'До кінця тижня працівники комунального підприємства «Комбінат благоустрою» висадять квіти в центральній частині міста.\r\nВже завершують висадку на клумбах на площі Кирила і Мефодія.\r\nВодночас організовується полив квітів, пише Мукачівська міськрада. ', 'Мукачево', '05/04/2016');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `firstname` varchar(100) NOT NULL,
  `lastname` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `code` varchar(100) NOT NULL,
  `activated` int(100) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
